<?php

return [
    'form' => [
        'first_name' => 'نام',
        'last_name' => 'نام‌خانوادگی',
        'mobile' => 'شماره‌همراه',
        'username' => 'نام‌کاربری',
    ],
    'notification' => [
        'title' => 'پروفایل با موفقیت بروزرسانی شد',
    ],
    'expiration' => [
        'message' => 'این حساب‌کاربری منقضی شده است. لطفا با پشتیبانی تماس بگیرید.',
    ],
    'otp' => [
        'verify_mobile_title' => 'تایید حساب‌کاربری از طریق موبایل',
        'verify_code_title' => 'تایید حساب‌کاربری از طریق ایمیل',
        'resend_action' => 'ارسال مجدد کد',
        'validation' => 'کد صحیح نیست',
        'expired' => 'کد منقضی شده است، دوباره درخواست دهید',
        'mobile_label' => 'کدی که به شماره همراه شما ارسال شده را وارد کنید',
        'code_label' => 'کدی که به آدرس ایمیل شما ارسال شده را وارد کنید',
        'prompt_action' => 'ارسال',
    ],
    'reset_password' => [
        'request' => [
            'notification' => [
                'mobile' => [
                    'title' => 'پیامک ارسال شد',
                    'body' => 'کد بازنشانی رمز عبور به شماره وارد شده، ارسال شد',
                ],
                'code' => [
                    'title' => 'ایمیل ارسال شد',
                    'body' => 'کد بازنشانی رمز عبور به ایمیل وارد شده، ارسال شد',
                ],
            ],
            'action' => [
                'email' => 'ارسال ایمیل',
                'mobile' => 'ارسال پیامک',
            ]
        ],
        'text_message' => ':app, کد جهت تغییر رمز: :code',
        'mail_message' => [
            'subject' => 'پیام بازنشانی رمزعبور',
            'greeting' => 'سلام',
            'line1' => 'شما این پیام که دربرگیرنده یک کد ۴ رقمی است را به دلیل درخواست بازنشانی رمز عبور، دریافت کردید ',
            'line2' => 'لطفا کد زیر را در صفحه بازنشانی رمز عبور وارد کنید',
            'action' => 'بازنشانی رمز عبور',
            'timeout' => 'اعتبار این کد :count دقیقه است',
            'ending' => 'اگر شما درخواست بازنشانی رمز عبور ندادید، هیچ کارخاصی لازم نیست انجام دهید',
            'salutation' => 'با احترام،<br>:name',
        ],
    ],
    'verify' => [
        'prompt' => [
            'notification' => [
                'mobile' => [
                    'title' => 'پیامک ارسال شد',
                    'body' => 'کد تایید به شماره وارد شده، ارسال شد',
                ],
                'code' => [
                    'title' => 'ایمیل ارسال شد',
                    'body' => 'کد تایید به ایمیل وارد شده، ارسال شد',
                ],
            ],
            'action' => [
                'label' => 'ارسال',
            ]
        ],
        'text_message' => ':app, کد تایید حساب‌کاربری: :code',
        'mail_message' => [
            'subject' => 'تایید آدرس ایمیل',
            'greeting' => 'سلام',
            'line1' => 'شما این پیام که دربرگیرنده یک کد ۴ رقمی است را به جهت تایید آدرس ایمیل، دریافت کردید.',
            'line2' => 'لطفا کد زیر را در صفحه تایید آدرس ایمیل وارد کنید.',
            'action' => 'تایید آدرس ایمیل',
            'timeout' => 'اعتبار این کد :count دقیقه است',
            'ending' => 'اگر شما حساب کاربری جدید ایجاد نکردید، هیچ کارخاصی لازم نیست انجام دهید',
            'salutation' => 'با احترام،<br>:name',
        ],
    ],
];
