<?php

return [
    'gender' => [
        'female' => 'زن',
        'male' => 'مرد',
        'undefined' => 'نا‌مشخص',
        'ms' => 'خانم',
        'mr' => 'آقای',
        'girl' => 'دختر',
        'boy' => 'پسر',
    ],
    'marriage' => [
        'single' => 'مجرد',
        'married' => 'متأهل',
        'unknown' => 'نا‌معلوم',
    ],
    'form' => [
        'first_name' => 'نام',
        'last_name' => 'نام‌خانوادگی',
        'nid' => 'شماره‌ملی',
        'nid_pass' => 'شماره‌ملی/شماره‌پاسپورت',
        'gender' => 'جنسیت',
        'birth_date' => 'تاریخ‌تولد',
        'mobile' => 'شماره‌همراه',
        'username' => 'نام‌کاربری',
        'roles' => 'نقش‌ها',
        'user_profile' => 'پروفایل',
        'account' => 'حساب‌کاربری',
        'password' => 'رمز‌عبور',
        'expiration_date' => 'تاریخ‌انقضای‌حساب',
        'force_change_password' => 'اجبار‌به‌تغییر‌رمز',
        'profile' => [
            'father_name' => 'نام‌پدر',
        ],
    ],
    'notification' => [
        'title' => 'پروفایل با موفقیت بروزرسانی شد',
    ],
    'expiration' => [
        'message' => 'این حساب‌کاربری منقضی شده است. لطفا با پشتیبانی تماس بگیرید.',
    ],
    'otp' => [
        'verify_mobile_title' => 'تایید حساب‌کاربری از طریق موبایل',
        'verify_code_title' => 'تایید حساب‌کاربری از طریق ایمیل',
        'resend_code' => 'ارسال مجدد کد',
        'validation' => 'کد صحیح نیست',
        'expired' => 'کد منقضی شده است، دوباره درخواست دهید',
        'mobile_label' => 'کدی را که به شماره همراه شما ارسال شده وارد کنید',
        'code_label' => 'کدی را که به آدرس ایمیل شما ارسال شده وارد کنید',
        'prompt_action' => 'ارسال',
    ],
    'reset_password' => [
        'request' => [
            'notification' => [
                'mobile' => [
                    'title' => 'پیامک ارسال شد',
                    'body' => 'کد بازنشانی رمز عبور به شماره وارد شده، ارسال شد',
                ],
                'code' => [
                    'title' => 'ایمیل ارسال شد',
                    'body' => 'کد بازنشانی رمز عبور به ایمیل وارد شده، ارسال شد',
                ],
            ],
            'action' => [
                'email' => 'ارسال ایمیل',
                'mobile' => 'ارسال پیامک',
            ]
        ],
        'text_message' => ':app, کد جهت تغییر رمز: :code',
        'mail_message' => [
            'subject' => 'پیام بازنشانی رمزعبور',
            'greeting' => 'سلام',
            'line1' => 'شما این پیام که دربرگیرنده یک کد ۴ رقمی است را به دلیل درخواست بازنشانی رمز عبور، دریافت کردید ',
            'line2' => 'لطفا کد زیر را در صفحه بازنشانی رمز عبور وارد کنید',
            'action' => 'بازنشانی رمز عبور',
            'timeout' => 'اعتبار این کد :count دقیقه است',
            'ending' => 'اگر شما درخواست بازنشانی رمز عبور ندادید، هیچ کارخاصی لازم نیست انجام دهید',
            'salutation' => 'با احترام،<br>:name',
        ],
    ],
    'verify' => [
        'prompt' => [
            'notification' => [
                'mobile' => [
                    'title' => 'پیامک ارسال شد',
                    'body' => 'کد تایید به شماره وارد شده، ارسال شد',
                ],
                'code' => [
                    'title' => 'ایمیل ارسال شد',
                    'body' => 'کد تایید به ایمیل وارد شده، ارسال شد',
                ],
            ],
            'action' => [
                'label' => 'ارسال',
            ]
        ],
        'text_message' => ':app, کد تایید حساب‌کاربری: :code',
        'mail_message' => [
            'subject' => 'تایید آدرس ایمیل',
            'greeting' => 'سلام',
            'line1' => 'شما این پیام که دربرگیرنده یک کد ۴ رقمی است را به جهت تایید آدرس ایمیل، دریافت کردید.',
            'line2' => 'لطفا کد زیر را در صفحه تایید آدرس ایمیل وارد کنید.',
            'action' => 'تایید آدرس ایمیل',
            'timeout' => 'اعتبار این کد :count دقیقه است',
            'ending' => 'اگر شما حساب کاربری جدید ایجاد نکردید، هیچ کارخاصی لازم نیست انجام دهید',
            'salutation' => 'با احترام،<br>:name',
        ],
    ],
];
